thorrockstar/meta-thornxt-stm/recipes-bsp/trusted-firmware-a/patches/_stm32mp1_clk.c
	if (lse_css) {
		mmio_setbits_32(address, RCC_BDCR_LSECSSON);
	}
}

/*******************************************************************************
 * This function determines the number of needed RTC calendar read operations
 * to get consistent values (1 or 2 depending on clock frequencies).
 * If APB1 frequency is lower than 7 times the RTC one, the software has to
 * read the calendar time and date registers twice.
 * Returns true if read twice is needed, false else.
 ******************************************************************************/
bool stm32mp1_rtc_get_read_twice(void)
{
	unsigned long apb1_freq;
	uint32_t rtc_freq;
	uint32_t apb1_div;
	uintptr_t rcc_base = stm32mp_rcc_base();

	switch ((mmio_read_32(rcc_base + RCC_BDCR) &
		 RCC_BDCR_RTCSRC_MASK) >> RCC_BDCR_RTCSRC_SHIFT) {
	case 1:
		rtc_freq = stm32mp_clk_get_rate(CK_LSE);
		break;
	case 2:
		rtc_freq = stm32mp_clk_get_rate(CK_LSI);
		break;
	case 3:
		rtc_freq = stm32mp_clk_get_rate(CK_HSE);
		rtc_freq /= (mmio_read_32(rcc_base + RCC_RTCDIVR) &
			     RCC_DIVR_DIV_MASK) + 1U;
		break;
	default:
		panic();
	}

	apb1_div = mmio_read_32(rcc_base + RCC_APB1DIVR) & RCC_APBXDIV_MASK;
	apb1_freq = stm32mp_clk_get_rate(CK_MCU) >> apb1_div;

	return apb1_freq < (rtc_freq * 7U);
}

static void stm32mp1_pkcs_config(uint32_t pkcs)
{
	uintptr_t address = stm32mp_rcc_base() + ((pkcs >> 4) & 0xFFFU);
	uint32_t value = pkcs & 0xFU;
	uint32_t mask = 0xFU;

	if ((pkcs & BIT(31)) != 0U) {
		mask <<= 4;
		value <<= 4;
	}

	mmio_clrsetbits_32(address, mask, value);
}

static bool clk_pll1_settings_are_valid(void)
{
	return pll1_settings.valid_id == PLL1_SETTINGS_VALID_ID;
}

int stm32mp1_round_opp_khz(uint32_t *freq_khz)
{
	unsigned int i;
	uint32_t round_opp = 0U;

	if (!clk_pll1_settings_are_valid()) {
		/*
		 * No OPP table in DT, or an error occurred during PLL1
		 * settings computation, system can only work on current
		 * operating point, so return current CPU frequency.
		 */
		*freq_khz = current_opp_khz;

		return 0;
	}

	for (i = 0; i < PLAT_MAX_OPP_NB; i++) {
		if ((pll1_settings.freq[i] <= *freq_khz) &&
		    (pll1_settings.freq[i] > round_opp)) {
			round_opp = pll1_settings.freq[i];
		}
	}

	*freq_khz = round_opp;

	return 0;
}

/*
 * Check if PLL1 can be configured on the fly.
 * @result (-1) => config on the fly is not possible.
 *         (0)  => config on the fly is possible.
 *         (+1) => same parameters, no need to reconfigure.
 * Return value is 0 if no error.
 */
static int stm32mp1_is_pll_config_on_the_fly(enum stm32mp1_pll_id pll_id,
					     uint32_t *pllcfg, uint32_t fracv,
					     int *result)
{
	const struct stm32mp1_clk_pll *pll = pll_ref(pll_id);
	uintptr_t rcc_base = stm32mp_rcc_base();
	uint32_t fracr;
	uint32_t value;
	int ret;

	ret = stm32mp1_pll_compute_pllxcfgr1(pll, pllcfg, &value);
	if (ret != 0) {
		return ret;
	}

	if (mmio_read_32(rcc_base + pll->pllxcfgr1) != value) {
		/* Different DIVN/DIVM, can't config on the fly */
		*result = -1;
		return 0;
	}

	*result = true;

	fracr = fracv << RCC_PLLNFRACR_FRACV_SHIFT;
	fracr |= RCC_PLLNFRACR_FRACLE;
	value = stm32mp1_pll_compute_pllxcfgr2(pllcfg);

	if ((mmio_read_32(rcc_base + pll->pllxfracr) == fracr) &&
	    (mmio_read_32(rcc_base + pll->pllxcfgr2) == value)) {
		/* Same parameters, no need to config */
		*result = 1;
	} else {
		*result = 0;
	}

	return 0;
}

static int stm32mp1_get_mpu_div(uint32_t freq_khz)
{
	unsigned long freq_pll1_p;
	unsigned long div;

	freq_pll1_p = get_clock_rate(_PLL1_P) / 1000UL;
	if ((freq_pll1_p % freq_khz) != 0U) {
		return -1;
	}

	div = freq_pll1_p / freq_khz;

	switch (div) {
	case 1UL:
	case 2UL:
	case 4UL:
	case 8UL:
	case 16UL:
		return __builtin_ffs(div) - 1;
	default:
		return -1;
	}
}

static int stm32mp1_pll1_config_from_opp_khz(uint32_t freq_khz)
{
	unsigned int i;
	int ret;
	int div;
	int config_on_the_fly = -1;

	for (i = 0; i < PLAT_MAX_OPP_NB; i++) {
		if (pll1_settings.freq[i] == freq_khz) {
			break;
		}
	}

	if (i == PLAT_MAX_OPP_NB) {
		return -ENXIO;
	}

	div = stm32mp1_get_mpu_div(freq_khz);

	switch (div) {
	case -1:
		break;
	case 0:
		return stm32mp1_set_clksrc(CLK_MPU_PLL1P);
	default:
		ret = stm32mp1_set_clkdiv(div, stm32mp_rcc_base() +
					  RCC_MPCKDIVR);
		if (ret == 0) {
			ret = stm32mp1_set_clksrc(CLK_MPU_PLL1P_DIV);
		}
		return ret;
	}

	ret = stm32mp1_is_pll_config_on_the_fly(_PLL1, &pll1_settings.cfg[i][0],
						pll1_settings.frac[i],
						&config_on_the_fly);
	if (ret != 0) {
		return ret;
	}

	if (config_on_the_fly == 1) {
		/*  No need to reconfigure, setup already OK */
		return 0;
	}

	if (config_on_the_fly == -1) {
		/* Switch to HSI and stop PLL1 before reconfiguration */
		ret = stm32mp1_set_clksrc(CLK_MPU_HSI);
		if (ret != 0) {
			return ret;
		}

		ret = stm32mp1_pll_stop(_PLL1);
		if (ret != 0) {
			return ret;
		}
	}

	ret = stm32mp1_pll_config(_PLL1, &pll1_settings.cfg[i][0],
				  pll1_settings.frac[i]);
	if (ret != 0) {
		return ret;
	}

	if (config_on_the_fly == -1) {
		/* Start PLL1 and switch back to after reconfiguration */
		stm32mp1_pll_start(_PLL1);

		ret = stm32mp1_pll_output(_PLL1,
					  pll1_settings.cfg[i][PLLCFG_O]);
		if (ret != 0) {
			return ret;
		}

		ret = stm32mp1_set_clksrc(CLK_MPU_PLL1P);
		if (ret != 0) {
			return ret;
		}
	}

	return 0;
}

int stm32mp1_set_opp_khz(uint32_t freq_khz)
{
	uintptr_t rcc_base = stm32mp_rcc_base();
	uint32_t mpu_src;

	if (freq_khz == current_opp_khz) {
		/* OPP already set, nothing to do */
		return 0;
	}

	if (!clk_pll1_settings_are_valid()) {
		/*
		 * No OPP table in DT or an error occurred during PLL1
		 * settings computation, system can only work on current
		 * operating point so return error.
		 */
		return -EACCES;
	}

	/* Check that PLL1 is MPU clock source */
	mpu_src = mmio_read_32(rcc_base + RCC_MPCKSELR) & RCC_SELR_SRC_MASK;
	if ((mpu_src != RCC_MPCKSELR_PLL) &&
	    (mpu_src != RCC_MPCKSELR_PLL_MPUDIV)) {
		return -EPERM;
	}

	if (stm32mp1_pll1_config_from_opp_khz(freq_khz) != 0) {
		/* Restore original value */
		if (stm32mp1_pll1_config_from_opp_khz(current_opp_khz) != 0) {
			ERROR("No CPU operating point can be set\n");
			panic();
		}

		return -EIO;
	}

	current_opp_khz = freq_khz;

