thorrockstar/meta-thornxt-stm/recipes-bsp/trusted-firmware-a/patches/_stm32mp1_clk.c
	return 0;
}

static int clk_get_pll_settings_from_dt(int plloff, unsigned int *pllcfg,
					uint32_t *fracv, uint32_t *csg,
					bool *csg_set)
{
	void *fdt;
	int ret;

	if (fdt_get_address(&fdt) == 0) {
		return -FDT_ERR_NOTFOUND;
	}

	ret = fdt_read_uint32_array(fdt, plloff, "cfg", (uint32_t)PLLCFG_NB,
				    pllcfg);
	if (ret < 0) {
		return -FDT_ERR_NOTFOUND;
	}

	*fracv = fdt_read_uint32_default(fdt, plloff, "frac", 0);

	*csg_set = 0;

	if (ret == -FDT_ERR_NOTFOUND) {
		ret = 0;
	}

	return ret;
}

static int clk_compute_pll1_settings(unsigned long input_freq,
				     uint32_t freq_khz,
				     uint32_t *pllcfg, uint32_t *fracv)
{
	unsigned long long output_freq = freq_khz * 1000U;
	unsigned long long freq;
	unsigned long long vco;
	int divm;
	int divn;
	int divp;
	int frac;
	int i;
	unsigned int diff;
	unsigned int best_diff = UINT_MAX;

	/* Following parameters have always the same value */
	pllcfg[PLLCFG_Q] = 0;
	pllcfg[PLLCFG_R] = 0;
	pllcfg[PLLCFG_O] = PQR(1, 0, 0);

	for (divm = DIVM_MAX; divm >= DIVM_MIN; divm--)	{
		unsigned long post_divm = input_freq /
					  (unsigned long)(divm + 1);

		if ((post_divm < POST_DIVM_MIN) ||
		    (post_divm > POST_DIVM_MAX)) {
			continue;
		}

		for (divp = DIVP_MIN; divp <= DIVP_MAX; divp++) {

			freq = output_freq * (divm + 1) * (divp + 1);

			divn = (int)((freq / input_freq) - 1);
			if ((divn < DIVN_MIN) || (divn > DIVN_MAX)) {
				continue;
			}

			frac = (int)(((freq * FRAC_MAX) / input_freq) -
				     ((divn + 1) * FRAC_MAX));

			/* 2 loops to refine the fractional part */
			for (i = 2; i != 0; i--) {
				if (frac > FRAC_MAX) {
					break;
				}

				vco = (post_divm * (divn + 1)) +
				      ((post_divm * (unsigned long long)frac) /
				       FRAC_MAX);

				if ((vco < (VCO_MIN / 2)) ||
				    (vco > (VCO_MAX / 2))) {
					frac++;
					continue;
				}

				freq = vco / (divp + 1);
				if (output_freq < freq) {
					diff = (unsigned int)(freq -
							      output_freq);
				} else {
					diff = (unsigned int)(output_freq -
							      freq);
				}

				if (diff < best_diff)  {
					pllcfg[PLLCFG_M] = divm;
					pllcfg[PLLCFG_N] = divn;
					pllcfg[PLLCFG_P] = divp;
					*fracv = frac;

					if (diff == 0) {
						return 0;
					}

					best_diff = diff;
				}

				frac++;
			}
		}
	}

	if (best_diff == UINT_MAX) {
		return -1;
	}

	return 0;
}

static int clk_get_pll1_settings(uint32_t clksrc, uint32_t freq_khz,
				 uint32_t *pllcfg, uint32_t *fracv)
{
	unsigned int i;

	assert(pllcfg != NULL);
	assert(fracv != NULL);

	for (i = 0; i < PLAT_MAX_OPP_NB; i++) {
		if (pll1_settings.freq[i] == freq_khz) {
			break;
		}
	}

	if (((i == PLAT_MAX_OPP_NB) && (pll1_settings.valid_id == 0U)) ||
	    ((i < PLAT_MAX_OPP_NB) &&
	     (pll1_settings.cfg[i][PLLCFG_O] == 0U))) {
		unsigned long input_freq;

		/*
		 * Either PLL1 settings structure is completely empty,
		 * or these settings are not yet computed: do it.
		 */
		switch (clksrc) {
		case CLK_PLL12_HSI:
			input_freq = stm32mp_clk_get_rate(CK_HSI);
			break;
		case CLK_PLL12_HSE:
			input_freq = stm32mp_clk_get_rate(CK_HSE);
			break;
		default:
			panic();
		}

		return clk_compute_pll1_settings(input_freq, freq_khz, pllcfg,
						 fracv);
	}

	if ((i < PLAT_MAX_OPP_NB) &&
	    (pll1_settings.cfg[i][PLLCFG_O] != 0U)) {
		/*
		 * Index is in range and PLL1 settings are computed:
		 * use content to answer to the request.
		 */
		memcpy(pllcfg, &pll1_settings.cfg[i][0],
		       sizeof(uint32_t) * PLAT_MAX_PLLCFG_NB);
		*fracv = pll1_settings.frac[i];

		return 0;
	}

	return -1;
}

int stm32mp1_clk_get_maxfreq_opp(uint32_t *freq_khz,
				 uint32_t *voltage_mv)
{
	unsigned int i;
	uint32_t freq = 0U;
	uint32_t voltage = 0U;

	assert(freq_khz != NULL);
	assert(voltage_mv != NULL);

	if (!clk_pll1_settings_are_valid()) {
		return -1;
	}

	for (i = 0; i < PLAT_MAX_OPP_NB; i++) {
		if (pll1_settings.freq[i] > freq) {
			freq = pll1_settings.freq[i];
			voltage = pll1_settings.volt[i];
		}
	}

	if ((freq == 0U) || (voltage == 0U)) {
		return -1;
	}

	*freq_khz = freq;
	*voltage_mv = voltage;

	return 0;
}

static int clk_save_current_pll1_settings(uint32_t buck1_voltage)
{
	const struct stm32mp1_clk_pll *pll = pll_ref(_PLL1);
	uint32_t rcc_base = stm32mp_rcc_base();
	uint32_t freq;
	unsigned int i;

	freq = udiv_round_nearest(stm32mp_clk_get_rate(CK_MPU), 1000L);

	for (i = 0; i < PLAT_MAX_OPP_NB; i++) {
		if (pll1_settings.freq[i] == freq) {
			break;
		}
	}

	if ((i == PLAT_MAX_OPP_NB) ||
	    ((pll1_settings.volt[i] != buck1_voltage) &&
	     (buck1_voltage != 0U))) {
		return -1;
	}

	pll1_settings.cfg[i][PLLCFG_M] =
		(mmio_read_32(rcc_base + pll->pllxcfgr1) &
		 RCC_PLLNCFGR1_DIVM_MASK) >> RCC_PLLNCFGR1_DIVM_SHIFT;

	pll1_settings.cfg[i][PLLCFG_N] =
		(mmio_read_32(rcc_base + pll->pllxcfgr1) &
		 RCC_PLLNCFGR1_DIVN_MASK) >> RCC_PLLNCFGR1_DIVN_SHIFT;

	pll1_settings.cfg[i][PLLCFG_P] =
		(mmio_read_32(rcc_base + pll->pllxcfgr2) &
		 RCC_PLLNCFGR2_DIVP_MASK) >> RCC_PLLNCFGR2_DIVP_SHIFT;

	pll1_settings.cfg[i][PLLCFG_Q] =
		(mmio_read_32(rcc_base + pll->pllxcfgr2) &
		 RCC_PLLNCFGR2_DIVQ_MASK) >> RCC_PLLNCFGR2_DIVQ_SHIFT;

	pll1_settings.cfg[i][PLLCFG_R] =
		(mmio_read_32(rcc_base + pll->pllxcfgr2) &
		 RCC_PLLNCFGR2_DIVR_MASK) >> RCC_PLLNCFGR2_DIVR_SHIFT;

	pll1_settings.cfg[i][PLLCFG_O] =
		mmio_read_32(rcc_base + pll->pllxcr) >>
		RCC_PLLNCR_DIVEN_SHIFT;

	pll1_settings.frac[i] =
		(mmio_read_32(rcc_base + pll->pllxfracr) &
		 RCC_PLLNFRACR_FRACV_MASK) >> RCC_PLLNFRACR_FRACV_SHIFT;

	return i;
}

static uint32_t stm32mp1_clk_get_pll1_current_clksrc(void)
{
	uint32_t value;
	const struct stm32mp1_clk_pll *pll = pll_ref(_PLL1);
	uint32_t rcc_base = stm32mp_rcc_base();

	value = mmio_read_32(rcc_base + pll->rckxselr);

	switch (value & RCC_SELR_REFCLK_SRC_MASK) {
	case 0:
		return CLK_PLL12_HSI;
	case 1:
		return CLK_PLL12_HSE;
	default:
		panic();
	}
}

int stm32mp1_clk_compute_all_pll1_settings(uint32_t buck1_voltage)
{
	int i;
	int ret;
	int index;
	uint32_t count = PLAT_MAX_OPP_NB;
	uint32_t clksrc;

	ret = dt_get_all_opp_freqvolt(&count, pll1_settings.freq,
				      pll1_settings.volt);
	switch (ret) {
	case 0:
		break;
	case -FDT_ERR_NOTFOUND:
		VERBOSE("Cannot find OPP table in DT, use default settings.\n");
		return 0;
	default:
		ERROR("Inconsistent OPP settings found in DT, ignored.\n");
		return 0;
	}

	index = clk_save_current_pll1_settings(buck1_voltage);

	clksrc = stm32mp1_clk_get_pll1_current_clksrc();

	for (i = 0; i < (int)count; i++) {
		if (i == index) {
			continue;
		}

		ret = clk_get_pll1_settings(clksrc, pll1_settings.freq[i],
					    &pll1_settings.cfg[i][0],
					    &pll1_settings.frac[i]);
		if (ret != 0) {
			return ret;
		}
	}

