thorrockstar/meta-thornxt-stm/recipes-bsp/trusted-firmware-a/patches/_stm32mp1_clk.c
void stm32mp1_clock_stopmode_save(void)
{
	uintptr_t rcc_base = stm32mp_rcc_base();

	/* Save registers not restored after STOP mode */
	pll3cr = mmio_read_32(rcc_base + RCC_PLL3CR);
	pll4cr = mmio_read_32(rcc_base + RCC_PLL4CR);
	mssckselr = mmio_read_32(rcc_base + RCC_MSSCKSELR);
	mcudivr = mmio_read_32(rcc_base + RCC_MCUDIVR) & RCC_MCUDIV_MASK;
#if STM32MP_SP_MIN_IN_DDR
	mpapb_iwdg2 = (mmio_read_32(rcc_base + RCC_MP_APB4ENSETR) &
		    RCC_MP_APB4ENSETR_IWDG2APBEN);
	mpapb_iwdg1 = (mmio_read_32(rcc_base + RCC_MP_APB5ENSETR) &
		    RCC_MP_APB5ENSETR_IWDG1APBEN);
#endif

	enable_kernel_clocks();
}

static bool pll_is_running(uint32_t pll_offset)
{
	uintptr_t pll_cr = stm32mp_rcc_base() + pll_offset;

	return (mmio_read_32(pll_cr) & RCC_PLLNCR_PLLON) != 0U;
}

static bool pll_was_running(uint32_t saved_value)
{
	return (saved_value & RCC_PLLNCR_PLLON) != 0U;
}

int stm32mp1_clock_stopmode_resume(void)
{
	int res;
	uintptr_t rcc_base = stm32mp_rcc_base();

	if (pll_was_running(pll4cr) && !pll_is_running(RCC_PLL4CR)) {
		stm32mp1_pll_start(_PLL4);
	}

	if (pll_was_running(pll3cr)) {
		if (!pll_is_running(RCC_PLL3CR)) {
			stm32mp1_pll_start(_PLL3);
		}

		res = stm32mp1_pll_output(_PLL3,
					  pll3cr >> RCC_PLLNCR_DIVEN_SHIFT);
		if (res != 0) {
			return res;
		}
	}

	if (pll_was_running(pll4cr)) {
		res = stm32mp1_pll_output(_PLL4,
					  pll4cr >> RCC_PLLNCR_DIVEN_SHIFT);
		if (res != 0) {
			return res;
		}
	}

	/* Restore MCU clock src after PLL3 RDY */
	mmio_write_32(rcc_base + RCC_MSSCKSELR, mssckselr);

	/* Restore MCUDIV */
	res = stm32mp1_set_clkdiv(mcudivr, rcc_base + RCC_MCUDIVR);
	if (res != 0) {
		return res;
	}

#if STM32MP_SP_MIN_IN_DDR
	/* Restore IWDG clock */
	mmio_clrsetbits_32(rcc_base + RCC_MP_APB5ENSETR,
			   RCC_MP_APB5ENSETR_IWDG1APBEN,
			   mpapb_iwdg1);

	mmio_clrsetbits_32(rcc_base + RCC_MP_APB4ENSETR,
			   RCC_MP_APB4ENSETR_IWDG2APBEN,
			   mpapb_iwdg2);
#endif

	disable_kernel_clocks();

	return 0;
}

void stm32mp1_clk_mcuss_protect(bool enable)
{
	uintptr_t rcc_base = stm32mp_rcc_base();

	if (enable) {
		mmio_setbits_32(rcc_base + RCC_TZCR, RCC_TZCR_MCKPROT);
	} else {
		mmio_clrbits_32(rcc_base + RCC_TZCR, RCC_TZCR_MCKPROT);
	}
}

/* Sync secure clock refcount after all drivers probe/inits,  */
void stm32mp1_dump_clocks_state(void)
{
#if LOG_LEVEL >= LOG_LEVEL_VERBOSE
	unsigned int idx;

	/* Dump clocks state */
	for (idx = 0U; idx < NB_GATES; idx++) {
		const struct stm32mp1_clk_gate *gate = gate_ref(idx);
		unsigned long __unused clock_id = gate->index;
		unsigned int __unused refcnt = gate_refcounts[idx];
		int __unused p = stm32mp1_clk_get_parent(clock_id);

		VERBOSE("stm32mp1 clk %lu %sabled (refcnt %d) (parent %d %s)\n",
			clock_id, __clk_is_enabled(gate) ? "en" : "dis",
			refcnt, p,
			p < 0 ? "n.a" : stm32mp1_clk_parent_sel_name[p]);
	}
#endif
}

static void sync_earlyboot_clocks_state(void)
{
	unsigned int idx;
	const unsigned long secure_enable[] = {
		AXIDCG,
		BSEC,
		DDRC1, DDRC1LP,
		DDRC2, DDRC2LP,
		DDRCAPB, DDRPHYCAPB, DDRPHYCAPBLP,
		DDRPHYC, DDRPHYCLP,
		RTCAPB,
		TZC1, TZC2,
		TZPC,
		STGEN_K,
	};

	for (idx = 0U; idx < ARRAY_SIZE(secure_enable); idx++) {
		stm32mp_clk_enable(secure_enable[idx]);
	}
}

static const clk_ops_t stm32mp_clk_ops = {
	.enable		= stm32mp_clk_enable,
	.disable	= stm32mp_clk_disable,
	.is_enabled	= stm32mp_clk_is_enabled,
	.get_rate	= stm32mp_clk_get_rate,
	.get_parent	= stm32mp1_clk_get_parent,
};

int stm32mp1_clk_probe(void)
{
	unsigned long freq_khz;

	assert(PLLCFG_NB == PLAT_MAX_PLLCFG_NB);

#if defined(IMAGE_BL32)
	if (!fdt_get_rcc_secure_state()) {
		mmio_write_32(stm32mp_rcc_base() + RCC_TZCR, 0U);
	}
#endif

	stm32mp1_osc_init();

	sync_earlyboot_clocks_state();

	/* Save current CPU operating point value */
	freq_khz = udiv_round_nearest(stm32mp_clk_get_rate(CK_MPU), 1000UL);
	if (freq_khz > (unsigned long)UINT32_MAX) {
		panic();
	}

	current_opp_khz = (uint32_t)freq_khz;

	clk_register(&stm32mp_clk_ops);

	return 0;
}
